$.extend({
	APP_DATA:{
		FB_ID:"1597441743853321",
		FB_PERMISSIONS:"publish_actions",
		KAKAO_API_KEY:"bda42e0057c19604d8346d0ef243baa8",
		YOUTUBE_ID:"h_X7UDYHIn8",
		YOUTUBE_PARAMS:{'rel':0, 'showinfo': 0, 'wmode':'transparent', 'autoplay':0, 'loop':1},
		URL_FACEBOOK:"https://www.facebook.com/theremedy.kr?fref=ts",
		URL_YOUTUBE:"https://youtu.be/h_X7UDYHIn8",
		URL_HOME:"http://theremedy.lgbeautymall.com/",
		URL_EVENT_2:"http://www.theremedy-promise.com/?event=2",
		URL_POLICY:"http://www.l-caremembers.com/customer/privacy.jsp"
	},

	log:function($o){
		if(window.console && window.console.log.apply)
			console.log.apply(console, arguments);
		else if(window.console)
			console.log($o);
	},

	getMonthBackground:function($idx){
		return "http://d246vnevj641m5.cloudfront.net/theremedy201506/pc/bg-"+$idx+".jpg";
	},

	getMonthDescript:function($idx){
		return "http://d246vnevj641m5.cloudfront.net/theremedy201506/pc/month-descript-"+$idx+".png";
	},
//==========================================================================================================================================================

/* !------------------------------------------------- */
/* ! 	Facebook  */

//==========================================================================================================================================================
	initFacebook:function(){
		$.ajaxSetup({cache:true});
		$.getScript('//connect.facebook.net/e/sdk.js', function(){
			FB.init({
				appId: $.APP_DATA.FB_ID,
				version:"v2.1",
		        status: true,
		        cookie: true,
				xfbml: true
		    });
		    FB.getLoginStatus(function($response){
		    	$.log("initFacebook -"+$response.status);
		    	$.loginStatus = $response.status;
		    });
		});	
	},

	loginFacebook:function($success, $failed){
		if($.isDevice()){
			var __redirect = "http://theremedy-promise.com/";
			var __url = "https://www.facebook.com/dialog/oauth?client_id="+$.APP_DATA.FB_ID+"&redirect_uri="+__redirect+"&auth_type=rerequest&scope="+$.APP_DATA.FB_PERMISSIONS+"&fbconnect=1&method=permissions.request";

			window.location.href = __url;
		}else{
			FB.login(function($response){
				$.log($response);
				if($response.status === "connected"){
					$.log("loginFacebook :success!");
					$.loginStatus = $response.status;
					$.shareFacebookDialog($success, $failed);
				}else{
					$.log("loginFacebook :failed!");
					alert("페이스북 로그인에 실패하였습니다.");
					$failed();
				}
			}, {scope:$.APP_DATA.FB_PERMISSIONS, auth_type:"rerequest"});
		}
	},

	checkPermission:function($success, $failed){
		FB.api('/me/permissions', function($response){
			$.log($response);
			if($response && !$response.error){
				var __requestPerms = $.APP_DATA.FB_PERMISSIONS.split(",");

				$response.data.forEach(function(__userData){
					$.log(__userData);
					for(var j=0; j<__requestPerms.length; j++){
						if(__userData.permission == __requestPerms[j] && __userData.status == "granted")
							__requestPerms.splice(j, 1);
					}
				});
					
				if(__requestPerms.length == 0)
					$success();
				else
					$failed();
			}
			else
				$failed();
		});
	},



//==========================================================================================================================================================

/* !------------------------------------------------- */
/* ! 	SHARE  */

//==========================================================================================================================================================
	shareFacebook:function($success, $failed){
		if($.loginStatus == "connected"){
			$.checkPermission(function(){
				$.log("shareFacebook - checkPermission success");
				
				var __postData = {};
				__postData.link = $.APP_DATA.URL_YOUTUBE;
				__postData.name = "흔들리는 피부를 위한 약속";
				__postData.description = "사계절 흔들리지 않는 아름다운 피부를 위해";		 		
				// __postData.privacy = {value:"SELF"}; 
				
				FB.api("/me/feed", "POST", __postData, function($response){
					if($response && !$response.error){
						$success($response);
						$.log("shareFacebook - feed success");
					}else{
						alert("페이스북 공유에 실패하였습니다.");
						$failed($response);
						$.log("shareFacebook - feed failed");
					}
				});
			}, function(){
				$.log("shareFacebook - checkPermission failed");
				$.loginFacebook($success, $failed);
			});
		}else{
			$.log("shareFacebook - user not login");
			$.loginFacebook($success, $failed);
		}		
	},

	shareFacebookDialog:function($success, $failed){
		if($.loginStatus == "connected"){
			$.checkPermission(function(){
				$.log("shareFacebookDialog - checkPermission success");
				FB.ui({
				  method:"feed",
				  link:$.APP_DATA.URL_YOUTUBE,
				  name:"흔들리는 피부를 위한 약속",
				  description:"사계절 흔들리지 않는 아름다운 피부를 위해"
				}, function(response){
					$.log("response ", response);
					if(response)
						$success();
					else
						$failed();
				});
			}, function(){
				$.log("shareFacebookDialog - checkPermission failed");
				$.loginFacebook($success, $failed);
			});
		}else{
			$.log("shareFacebookDialog - user not login");
			$.loginFacebook($success, $failed);
		}		
	},

	shareTwitter:function(){
		var __msg = "흔들리는 피부를 위한 약속\n"+$.APP_DATA.URL_YOUTUBE;
		window.open("https://twitter.com/intent/tweet?text="+encodeURIComponent(__msg));
	},


	shareKakaoTalk:function(){
		var __data = {label:"", webButton:{text:"뿌리크림 체험분 받기", url:"http://"+$.getDomain()}};
		__data.label  = "계절과 환경이 달라져도\n";
		__data.label += "흔들리지 않는\n";
		__data.label += "피부를 경험하세요.\n\n";
		__data.label += "사계절 수분과 영양을\n";
		__data.label += "꽉 잡아주는\n";
		__data.label += "더레미디 뿌리크림\n\n";
		__data.label += "▼뿌리의 약속 확인하기\n";
		__data.label += $.APP_DATA.URL_YOUTUBE;

		Kakao.Link.sendTalkLink(__data);
	},

	shareKakaoStory:function(){
		var __msg = "카카오스토리";
		__msg += "카카오스토리\n";
		__msg += "카카오스토리\n";
		__msg += "카카오스토리\n";
		__msg += $.APP_DATA.URL_YOUTUBE;
	
  		kakao.link("story").send({
	        post:__msg,
	        appid:$.getDomain(),
	        appver:"1.0",
	        appname:"TheRemedy"
	    });
	},

//==========================================================================================================================================================

/* !------------------------------------------------- */
/* ! 	KaKao  */

//==========================================================================================================================================================
	initKaKao:function(){
		$.getScript('https://developers.kakao.com/sdk/js/kakao.min.js', function(){
			Kakao.init($.APP_DATA.KAKAO_API_KEY);
		});
		// $.getScript('http://d246vnevj641m5.cloudfront.net/lib/origin/kakao.link.min.js', function(){
		// });
	},


//==========================================================================================================================================================

/* !------------------------------------------------- */
/* ! 	Youtube  */

//==========================================================================================================================================================
	initYoutube:function(){
		var tag = document.createElement('script');		
		var firstScriptTag = document.getElementsByTagName('script')[0];
		tag.src = "https://www.youtube.com/iframe_api";
		firstScriptTag.parentNode.insertBefore(tag, firstScriptTag);

		$.ytPlayers = {};
	},


//==========================================================================================================================================================

/* !------------------------------------------------- */
/* ! 	Store  */

//==========================================================================================================================================================
	getStoreAtLocation:function($loca1, $loca2){	
		function findLocation(value, index, ar){
		    return (value["주소"].indexOf($loca1+" "+$loca2) > -1);
		}
		return $.STORE.filter(findLocation);
	},

	searchStore:function($location){
		var __arr = $location.split(" ");	
		function searchLocation(value, index, ar){
			var __value = true;
			for(var idx in __arr){
				if((value["주소"].indexOf(__arr[idx]) == -1) && (value["매장명"].indexOf(__arr[idx]) == -1))
					__value = false;
				
			}
		    return __value
		}
		return $.STORE.filter(searchLocation);
	},

	STORE_LOCATION:{
		"시/도":["서울", "경기", "부산", "인천", "대전", "대구", "경남", "광주", "울산", "충남", "충북", "전남", "전북", "제주"],
		"시/도 선택":[],
		"경기":["고양시", "광명시", "구리시", "군포시", "김포시", "부천시", "성남시", "수원시", "안산시", "안양시", "용인시", "의정부시", "이천시", "평택시", "하남시", "화성시"],
		"경남":["김해시", "창원시"],
		"광주":["광산구", "동구", "서구"],
		"대구":["북구", "중구"],
		"대전":["서구", "중구"],
		"부산":["금정구", "동래구", "부산진구", "북구", "사하구", "중구", "진구", "해운대구"],
		"서울":["강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", 
			   "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "종로구", "중구", "중랑구"],
		"울산":["남구"],
		"인천":["계양구", "남구", "남동구", "부평구", "서구", "연수구", "중구"],
		"전남":["광양시"],
		"전북":["전주시"],
		"제주":["제주시"],
		"충남":["아산시", "천안시"],
		"충북":["청주시"]
	},

	STORE:[
		{"code":"B169","매장명":"올리브영_화정로데오점","주소":"경기 고양시 덕양구 화정동 979-1","전화":"031-974-8831"},
		{"code":"507651","매장명":"왓슨스_화정점","주소":"경기 고양시 덕양구 화정동 981-2","전화":"031-979-7511"},
		{"code":"503367","매장명":"왓슨스_라페스타점","주소":"경기 고양시 일산동구 장항동 766","전화":"031-904-8708"},
		{"code":"D057","매장명":"올리브영_라페스타점","주소":"경기 고양시 일산동구 장항동 766","전화":"031-902-5214"},
		{"code":"D178","매장명":"올리브영_정발산로점","주소":"경기 고양시 일산동구 장항동 862-1","전화":"031-901-5771"},
		{"code":"D040","매장명":"올리브영_웨스턴돔점","주소":"경기 고양시 일산동구 장항동 867","전화":"031-906-5290"},
		{"code":"507425","매장명":"왓슨스_웨스턴돔점","주소":"경기 고양시 일산동구 장항동 868","전화":"031-931-5580"},
		{"code":"506463","매장명":"왓슨스_광명점","주소":"경기 광명시 광명동 150-48 ","전화":"02-2688-7573"},
		{"code":"510782","매장명":"왓슨스_광명사거리점","주소":"경기 광명시 광명동 158-793","전화":"02-2683-7533"},
		{"code":"508736","매장명":"왓슨스_철산점","주소":"경기 광명시 철산동 412","전화":"02-2688-7535"},
		{"code":"D363","매장명":"올리브영_광명하안점","주소":"경기 광명시 하안동 51","전화":"02-897-5190"},
		{"code":"D055","매장명":"올리브영_구리역점","주소":"경기 구리시 인창동 676-5","전화":"031-564-5290"},
		{"code":"505182","매장명":"왓슨스_산본역점","주소":"경기 군포시 산본동 1231 ","전화":"031-392-5594"},
		{"code":"508833","매장명":"왓슨스_금정점","주소":"경기 군포시 산본동 266-3","전화":"031-392-7534"},
		{"code":"D300","매장명":"올리브영_김포장기점","주소":"경기 김포시 장기동 1607","전화":"031-997-0317"},
		{"code":"504943","매장명":"왓슨스_역곡점","주소":"경기 부천시 소사구 괴안동 113-8 ","전화":"032-351-4190"},
		{"code":"511899","매장명":"왓슨스_부천세이브존","주소":"경기 부천시 원미구 상동 535-5","전화":"032-322-7578"},
		{"code":"D169","매장명":"올리브영_부천상동점","주소":"경기 부천시 원미구 상동 535-7","전화":"032-328-2273"},
		{"code":"505687","매장명":"왓슨스_부천역점","주소":"경기 부천시 원미구 심곡동 168-8 ","전화":"032-655-7760"},
		{"code":"D077","매장명":"올리브영_부천북부점","주소":"경기 부천시 원미구 심곡동 175-17 ","전화":"032-612-5290"},
		{"code":"D134","매장명":"올리브영_역곡역점","주소":"경기 부천시 원미구 역곡동 77-9","전화":"032-349-8720"},
		{"code":"505071","매장명":"왓슨스_디몰점","주소":"경기 부천시 원미구 중동 128-9","전화":"032-623-1107"},
		{"code":"507409","매장명":"왓슨스_미금2호점","주소":"경기 성남시 분당구 금곡동 154","전화":"031-715-7524"},
		{"code":"D330","매장명":"올리브영_분당미금2호점","주소":"경기 성남시 분당구 금곡동 158","전화":"031-718-5290"},
		{"code":"504334","매장명":"왓슨스_미금점","주소":"경기 성남시 분당구 금곡동 161","전화":"031-782-4540"},
		{"code":"D111","매장명":"올리브영_분당미금역점","주소":"경기 성남시 분당구 금곡동 161 ","전화":"031-717-5296"},
		{"code":"D198","매장명":"올리브영_판교아브뉴프랑점","주소":"경기 성남시 분당구 삼평동 740","전화":"031-8017-7312"},
		{"code":"D298","매장명":"올리브영_서현역점","주소":"경기 성남시 분당구 서현동 248-5 ","전화":"031-705-5290"},
		{"code":"D083","매장명":"올리브영_분당서현점","주소":"경기 성남시 분당구 서현동 268-2","전화":"031-704-5293"},
		{"code":"B004","매장명":"올리브영_분당수내점","주소":"경기 성남시 분당구 수내1동 19-3","전화":"031-718-1008"},
		{"code":"B173","매장명":"올리브영_정자역점","주소":"경기 성남시 분당구 정자동 157-1","전화":"031-719-9477"},
		{"code":"507885","매장명":"왓슨스_신흥점","주소":"경기 성남시 수정구 신흥동 4207 ","전화":"031-747-7547"},
		{"code":"D220","매장명":"올리브영_태평역점","주소":"경기 성남시 수정구 태평동 6511","전화":"031-756-5290"},
		{"code":"511601","매장명":"왓슨스_아주대점","주소":"경기 수원시 영통구 원천동 18-1 ","전화":"031-214-7592"},
		{"code":"D065","매장명":"올리브영_수원AK역사점","주소":"경기 수원시 팔달구 매산로1가 18","전화":"031-240-2193"},
		{"code":"D080","매장명":"올리브영_수원역전점","주소":"경기 수원시 팔달구 매산로1가 53-16","전화":"031-251-5290"},
		{"code":"D271","매장명":"올리브영_수원인계점","주소":"경기 수원시 팔달구 인계동 1046-2","전화":"031-233-5290"},
		{"code":"509981","매장명":"왓슨스_안산점","주소":"경기 안산시 단원구 고잔동 539-19  ","전화":"031-484-7534"},
		{"code":"D131","매장명":"올리브영_안산선부점","주소":"경기 안산시 단원구 선부동 1081","전화":"031-482-1985"},
		{"code":"D276","매장명":"올리브영_상록수역점","주소":"경기 안산시 상록구 본오동 873-4","전화":"031-502-1787"},
		{"code":"511624","매장명":"왓슨스_범계중앙점","주소":"경기 안양시 동안구 호계동 1045-5","전화":"031-381-7506"},
		{"code":"D227","매장명":"올리브영_범계역점","주소":"경기 안양시 동안구 호계동 1046-6","전화":"031-387-5290"},
		{"code":"D119","매장명":"올리브영_안양1번가점","주소":"경기 안양시 만안구 안양동 674-105","전화":"031-443-5290"},
		{"code":"506895","매장명":"왓슨스_안양점","주소":"경기 안양시 만안구 안양동 674-208","전화":"031-445-7522"},
		{"code":"507459","매장명":"왓슨스_만안점","주소":"경기 안양시 만안구 안양동 676-7 ","전화":"031-445-7576"},
		{"code":"D149","매장명":"올리브영_강남대점","주소":"경기 용인시 기흥구 구갈동 581-1","전화":"031-282-5290"},
		{"code":"D312","매장명":"올리브영_용인수지2호점","주소":"경기 용인시 수지구 풍덕천동 1078 ","전화":"031-889-5290"},
		{"code":"D182","매장명":"올리브영_용인중앙점","주소":"경기 용인시 처인구 김량장동 301-3","전화":"031-335-0975"},
		{"code":"509523","매장명":"왓슨스_용인점","주소":"경기 용인시 처인구 김량장동 92-2 ","전화":"031-322-7536"},
		{"code":"D070","매장명":"올리브영_의정부중앙로점","주소":"경기 의정부시 의정부동 179-16","전화":"031-821-5290"},
		{"code":"507240","매장명":"왓슨스_의정부점","주소":"경기 의정부시 의정부동 195-13","전화":"031-821-7589"},
		{"code":"B058","매장명":"올리브영_의정부대로점","주소":"경기 의정부시 의정부동 200-18","전화":"031-856-5290"},
		{"code":"507426","매장명":"왓슨스_이천점","주소":"경기 이천시 창전동 158-17","전화":"031-633-2570"},
		{"code":"509182","매장명":"왓슨스_평택점","주소":"경기 평택시 평택동 51-7","전화":"031-656-7534"},
		{"code":"509800","매장명":"왓슨스_하남점","주소":"경기 하남시 신장동 427-78","전화":"031-795-7534"},
		{"code":"507408","매장명":"왓슨스_동탄점","주소":"경기 화성시 반송동 96~98","전화":"031-8003-4591"},
		{"code":"D100","매장명":"올리브영_동탄점","주소":"경기 화성시 반송동 98","전화":"031-371-6820"},
		{"code":"512100","매장명":"왓슨스_김해내외점","주소":"경남 김해시 외동 1256-1 ","전화":"055-314-7553"},
		{"code":"508407","매장명":"왓슨스_경남대점","주소":"경남 창원시 마산합포구 해운동 5-86","전화":"055-247-7535"},
		{"code":"508835","매장명":"왓슨스_상남점","주소":"경남 창원시 성산구 상남동 11-1","전화":"055-289-7534"},
		{"code":"509253","매장명":"왓슨스_상남2호점","주소":"경남 창원시 성산구 상남동 1-4","전화":"055-266-7534"},
		{"code":"D274","매장명":"올리브영_광주수완점","주소":"광주 광산구 수완동 1424","전화":"062-961-7818"},
		{"code":"D098","매장명":"올리브영_광주충장로점","주소":"광주 동구 금남로1가 19-1","전화":"062-225-5290"},
		{"code":"D267","매장명":"올리브영_광주상무역점","주소":"광주 서구 치평동 1176-1","전화":"062-371-5290"},
		{"code":"D105","매장명":"올리브영_대구칠곡점","주소":"대구 북구 구암동 765-2","전화":"053-325-5293"},
		{"code":"D273","매장명":"올리브영_경북대점","주소":"대구 북구 산격동 1341-1","전화":"053-939-5290"},
		{"code":"D148","매장명":"올리브영_동성로대백점","주소":"대구 중구 공평동 35-7","전화":"053-257-5290"},
		{"code":"D103","매장명":"올리브영_대구동성로2호점","주소":"대구 중구 동성로2가 138-5","전화":"053-256-5290"},
		{"code":"D355","매장명":"올리브영_대구동성로점","주소":"대구 중구 동성로2가 32-2","전화":"053-252-5295"},
		{"code":"D095","매장명":"올리브영_대구로데오점","주소":"대구 중구 삼덕동1가 17-5","전화":"053-253-5290"},
		{"code":"509978","매장명":"왓슨스_동성로점","주소":"대구 중구 삼덕동1가 5-11 ","전화":"053-256-7532"},
		{"code":"D320","매장명":"올리브영_대전관저점","주소":"대전 서구 관저동 1349","전화":"042-545-5290"},
		{"code":"D089","매장명":"올리브영_대전둔산점","주소":"대전 서구 둔산동 1071","전화":"042-471-5216"},
		{"code":"509643","매장명":"왓슨스_대전둔산점","주소":"대전 서구 둔산동 1072  ","전화":"042-485-7534"},
		{"code":"509338","매장명":"왓슨스_대전은행점","주소":"대전 중구 은행동 52-4 ","전화":"042-223-7533"},
		{"code":"D058","매장명":"올리브영_부산대역점","주소":"부산 금정구 장전동 293-12","전화":"051-990-7910"},
		{"code":"509327","매장명":"왓슨스_부산대점","주소":"부산 금정구 장전동 308-4","전화":"051-512-7535"},
		{"code":"512021","매장명":"왓슨스_부산대2호(부산대정문)","주소":"부산 금정구 장전동 418-45","전화":"051-583-7560"},
		{"code":"D163","매장명":"올리브영_부산동래점","주소":"부산 동래구 명륜동 532-4","전화":"051-558-5212"},
		{"code":"508735","매장명":"왓슨스_동래점","주소":"부산 동래구 명륜동 533-170 ","전화":"051-558-7535"},
		{"code":"D210","매장명":"올리브영_서면부전점","주소":"부산 부산진구 부전동 170-31 ","전화":"051-803-5290"},
		{"code":"D075","매장명":"올리브영_서면중앙점","주소":"부산 부산진구 부전동 165-2","전화":"051-819-5290"},
		{"code":"D061","매장명":"올리브영_서면1번가점","주소":"부산 부산진구 부전동 241-2 ","전화":"051-990-7914"},
		{"code":"508388","매장명":"왓슨스_덕천점","주소":"부산 북구 덕천동 400-10 ","전화":"051-338-7535"},
		{"code":"D211","매장명":"올리브영_부산덕천점","주소":"부산 북구 덕천동 401-15","전화":"051-343-9570"},
		{"code":"D277","매장명":"올리브영_부산화명점","주소":"부산 북구 화명동 2276-3","전화":"051-365-7718"},
		{"code":"D294","매장명":"올리브영_부산하단점","주소":"부산 사하구 당리동 303-16","전화":"051-294-8520"},
		{"code":"D188","매장명":"올리브영_남포2호점","주소":"부산 중구 광복동2가 41","전화":"051-254-0961"},
		{"code":"508834","매장명":"왓슨스_광복점","주소":"부산 중구 남포동5가 1-1","전화":"051-242-7534"},
		{"code":"508315","매장명":"왓슨스_남포역점","주소":"부산 중구 남포동1가 15 ","전화":"051-247-7533"},
		{"code":"509562","매장명":"왓슨스_서면점","주소":"부산 진구 부전동 217-3","전화":"051-802-7535"},
		{"code":"D212","매장명":"올리브영_부산센텀점","주소":"부산 해운대구 우동 1498 ","전화":"051-741-3662"},
		{"code":"D086","매장명":"올리브영_해운대스펀지점","주소":"부산 해운대구 우동 587-1","전화":"051-709-6044"},
		{"code":"D318","매장명":"올리브영_부산장산점","주소":"부산 해운대구 좌동 1481-1","전화":"051-701-5290"},
		{"code":"511611","매장명":"왓슨스_논현역점","주소":"서울 강남구 논현동 280","전화":"02-542-7570"},
		{"code":"D062","매장명":"올리브영_학동역점","주소":"서울 강남구 논현동 58-7 ","전화":"02-3446-5290"},
		{"code":"D032","매장명":"올리브영_선릉2호점","주소":"서울 강남구 대치동 889-71","전화":"02-563-7345"},
		{"code":"509569","매장명":"왓슨스_양재중앙점","주소":"서울 강남구 도곡동 957-3","전화":"02-571-7534"},
		{"code":"D321","매장명":"올리브영_코엑스몰점","주소":"서울 강남구 삼성동 159-6","전화":"02-551-5290"},
		{"code":"509359","매장명":"왓슨스_신사2호점","주소":"서울 강남구 신사동 515-8 ","전화":"02-518-7535"},
		{"code":"D063","매장명":"올리브영_가로수길점","주소":"서울 강남구 신사동 537-5","전화":"02-3446-8290"},
		{"code":"D029","매장명":"올리브영_강남대로점","주소":"서울 강남구 역삼동 826-24","전화":"02-538-5461"},
		{"code":"D026","매장명":"올리브영_역삼점","주소":"서울 강남구 역삼동 649-10","전화":"02-563-5240"},
		{"code":"510897","매장명":"왓슨스_선릉역점","주소":"서울 강남구 역삼동 702-28","전화":"02-6196-7935"},
		{"code":"D113","매장명":"올리브영_강남시티점","주소":"서울 강남구 역삼동 817-7","전화":"02-538-5290"},
		{"code":"D085","매장명":"올리브영_강남우성점","주소":"서울 강남구 역삼동 837","전화":"02-561-5290"},
		{"code":"D160","매장명":"올리브영_명일역점","주소":"서울 강동구 명일동 312-58","전화":"02-427-5290"},
		{"code":"D102","매장명":"올리브영_둔촌점","주소":"서울 강동구 성내동 440-30","전화":"02-475-5290"},
		{"code":"B023","매장명":"올리브영_천호역점","주소":"서울 강동구 천호동 455","전화":"02-478-7937"},
		{"code":"D260","매장명":"올리브영_수유점","주소":"서울 강북구 수유동 191-74","전화":"02-902-5290"},
		{"code":"D297","매장명":"올리브영_송정역점","주소":"서울 강서구 공항동 53-41","전화":"02-2664-2980"},
		{"code":"508719","매장명":"왓슨스_김포공항점","주소":"서울 강서구 방화동 712-1","전화":"02-2662-7535"},
		{"code":"D118","매장명":"올리브영_김포공항점","주소":"서울 강서구 방화동 886","전화":"02-6116-5523"},
		{"code":"511520","매장명":"왓슨스_염창역점","주소":"서울 강서구 염창동 284-84","전화":"02-3665-7568"},
		{"code":"509161","매장명":"왓슨스_까치산점","주소":"서울 강서구 화곡동 341-73","전화":"02-2690-7534"},
		{"code":"506462","매장명":"왓슨스_화곡점","주소":"서울 강서구 화곡동 1065-9","전화":"02-2604-7773"},
		{"code":"507872","매장명":"왓슨스_목동네거리점","주소":"서울 강서구 화곡동 781-1 ","전화":"02-2654-7532"},
		{"code":"D115","매장명":"올리브영_서울대입구점","주소":"서울 관악구 봉천동 855-11 ","전화":"02-871-5261"},
		{"code":"D230","매장명":"올리브영_서울대입구2호점","주소":"서울 관악구 봉천동 862-3","전화":"02-883-5290"},
		{"code":"507553","매장명":"왓슨스_관악점","주소":"서울 관악구 신림동 1424-28 ","전화":"02-888-7547"},
		{"code":"503317","매장명":"왓슨스_신림점","주소":"서울 관악구 신림동 1638-17 ","전화":"02-884-7605"},
		{"code":"D064","매장명":"올리브영_포도몰점","주소":"서울 관악구 신림동 1641-2","전화":"02-881-8060"},
		{"code":"D179","매장명":"올리브영_강변엔터식스점","주소":"서울 광진구 구의동 546-4","전화":"02-458-5290"},
		{"code":"507115","매장명":"왓슨스_건대점","주소":"서울 광진구 자양동 1-1 ","전화":"02-461-7571"},
		{"code":"D041","매장명":"올리브영_스타시티점","주소":"서울 광진구 자양동 227-7","전화":"02-2024-1344"},
		{"code":"511390","매장명":"왓슨스_건대입구역점","주소":"서울 광진구 화양동 4-20","전화":"02-456-7747"},
		{"code":"508184","매장명":"왓슨스_건대2호점","주소":"서울 광진구 화양동 7-44 ","전화":"02-469-7553"},
		{"code":"511551","매장명":"왓슨스_구로G밸리점","주소":"서울 구로구 구로동 188-25","전화":"02-6344-3945"},
		{"code":"508595","매장명":"왓슨스_구로점","주소":"서울 구로구 구로동 1125-6","전화":"02-867-7534"},
		{"code":"D056","매장명":"올리브영_구로디지털점","주소":"서울 구로구 구로동 187-10","전화":"02-867-8290"},
		{"code":"D110","매장명":"올리브영_디큐브시티점","주소":"서울 구로구 신도림동 692","전화":"02-2211-0768"},
		{"code":"506112","매장명":"왓슨스_가산디지털점","주소":"서울 금천구 가산동 60-15","전화":"02-838-7576"},
		{"code":"B107","매장명":"올리브영_노원점","주소":"서울 노원구 상계동 602-3","전화":"02-935-5290"},
		{"code":"D213","매장명":"올리브영_노원역사거리점","주소":"서울 노원구 상계동 727-1","전화":"02-934-5123"},
		{"code":"511391","매장명":"왓슨스_하계역점","주소":"서울 노원구 하계동 280","전화":"02-974-7745"},
		{"code":"D362","매장명":"올리브영_쌍문점","주소":"서울 도봉구 창동 659-5","전화":"02-905-5290"},
		{"code":"B148","매장명":"올리브영_쌍문역점","주소":"서울 도봉구 창동 659-5","전화":"02-998-3833"},
		{"code":"508017","매장명":"왓슨스_청량리점","주소":"서울 동대문구 청량리동 227, 280","전화":"02-969-7577"},
		{"code":"D008","매장명":"올리브영_경희대점","주소":"서울 동대문구 회기동 16-56  ","전화":"02-964-5290"},
		{"code":"508587","매장명":"왓슨스_노량진2호점","주소":"서울 동작구 노량진동 67-11","전화":"02-824-7535"},
		{"code":"D144","매장명":"올리브영_노량진역점","주소":"서울 동작구 노량진동 114-5","전화":"02-822-5294"},
		{"code":"506894","매장명":"왓슨스_노량진점","주소":"서울 동작구 노량진동 73-3","전화":"02-817-7576"},
		{"code":"B002","매장명":"올리브영_이수역점","주소":"서울 동작구 사당동 135-8","전화":"02-599-5390"},
		{"code":"504942","매장명":"왓슨스_성대시장점","주소":"서울 동작구 상도동 324-1","전화":"02-824-4167"},
		{"code":"503757","매장명":"왓슨스_중대점","주소":"서울 동작구 흑석동 223-1","전화":"02-3280-4460"},
		{"code":"511519","매장명":"왓슨스_흑석역점","주소":"서울 동작구 흑석동 4","전화":"02-822-7558"},
		{"code":"511605","매장명":"왓슨스_공덕역점","주소":"서울 마포구 공덕동 439","전화":"02-714-7745"},
		{"code":"511890","매장명":"왓슨스_홍대중앙점","주소":"서울 마포구 동교동 162-3","전화":"02-3141-7229"},
		{"code":"D011","매장명":"올리브영_홍익대점","주소":"서울 마포구 동교동 163-9 ","전화":"02-3143-5642"},
		{"code":"D203","매장명":"올리브영_홍대입구역점","주소":"서울 마포구 동교동 165-8","전화":"02-3144-3963"},
		{"code":"508547","매장명":"왓슨스_망원점","주소":"서울 마포구 망원동 378-2 ","전화":"02-335-7525"},
		{"code":"D278","매장명":"올리브영_상암MBC점","주소":"서울 마포구 상암동 1604","전화":"02-3152-9394"},
		{"code":"507930","매장명":"왓슨스_서교점","주소":"서울 마포구 서교동 358-113","전화":"02-333-7539"},
		{"code":"511517","매장명":"왓슨스_합정역점","주소":"서울 마포구 서교동 393","전화":"02-324-7554"},
		{"code":"506653","매장명":"왓슨스_대현점","주소":"서울 서대문구 대현동 40-30  ","전화":"02-313-5557"},
		{"code":"503122","매장명":"왓슨스_이대점","주소":"서울 서대문구 대현동 54-4","전화":"02-392-8208"},
		{"code":"D091","매장명":"올리브영_이대중앙점","주소":"서울 서대문구 대현동 56-126","전화":"02-365-5296"},
		{"code":"D022","매장명":"올리브영_연대점","주소":"서울 서대문구 창천동 18-31","전화":"02-392-5290"},
		{"code":"506397","매장명":"왓슨스_연대점","주소":"서울 서대문구 창천동 31-23","전화":"02-312-1270"},
		{"code":"D147","매장명":"올리브영_신촌연세점","주소":"서울 서대문구 창천동 33-4","전화":"02-322-1046"},
		{"code":"D288","매장명":"올리브영_신촌역점","주소":"서울 서대문구 창천동 72-2","전화":"02-3143-7805"},
		{"code":"511973","매장명":"왓슨스_신촌대로","주소":"서울 서대문구 창천동29-81","전화":"02-312-1938"},
		{"code":"508059","매장명":"왓슨스_홍제점","주소":"서울 서대문구 홍제동 161-1","전화":"02-396-7525"},
		{"code":"503176","매장명":"왓슨스_총신대점","주소":"서울 서초구 방배동 3160","전화":"02-534-7506"},
		{"code":"D175","매장명":"올리브영_교대역점","주소":"서울 서초구 서초3동 1573-1","전화":"02-523-5290"},
		{"code":"505795","매장명":"왓슨스_신논현역점","주소":"서울 서초구 서초동 1303-22 ","전화":"02-3288-3555"},
		{"code":"B001","매장명":"올리브영_강남역서초점","주소":"서울 서초구 서초동 1307-29","전화":"02-534-5290"},
		{"code":"D311","매장명":"올리브영_강남역사거리점","주소":"서울 서초구 서초동 1317-20","전화":"02-3478-8296"},
		{"code":"B068","매장명":"올리브영_서초타운점","주소":"서울 서초구 서초동 1327-11","전화":"02-588-8399"},
		{"code":"D046","매장명":"올리브영_남부터미널점","주소":"서울 서초구 서초동 1602-2","전화":"02-597-5290"},
		{"code":"D024","매장명":"올리브영_양재점","주소":"서울 서초구 양재동 11-2","전화":"02-579-5290"},
		{"code":"508093","매장명":"왓슨스_양재역점","주소":"서울 서초구 양재동 양재역","전화":"02-578-7587"},
		{"code":"D150","매장명":"올리브영_왕십리엔터식스점","주소":"서울 성동구 행당동 168-1","전화":"02-2200-6290"},
		{"code":"D164","매장명":"올리브영_돈암중앙점","주소":"서울 성북구 동선동1가 114-1","전화":"02-924-5290"},
		{"code":"508176","매장명":"왓슨스_성신여대점","주소":"서울 성북구 동선동1가 3-2","전화":"02-927-7535"},
		{"code":"D018","매장명":"올리브영_돈암점","주소":"서울 성북구 동선동1가 85-113","전화":"02-953-9540"},
		{"code":"D006","매장명":"올리브영_안암점","주소":"서울 성북구 안암동5가 102-77","전화":"02-953-5290"},
		{"code":"508185","매장명":"왓슨스_고대점","주소":"서울 성북구 안암동5가 102-87","전화":"02-928-7587"},
		{"code":"D020","매장명":"올리브영_신천점","주소":"서울 송파구 잠실동 184-2","전화":"02-2203-5290"},
		{"code":"509149","매장명":"왓슨스_파리공원점","주소":"서울 양천구 목5동","전화":"02-2649-7555"},
		{"code":"508387","매장명":"왓슨스_오목교점","주소":"서울 양천구 목동 159-1","전화":"02-2647-7535"},
		{"code":"D127","매장명":"올리브영_오목교점","주소":"서울 양천구 목동 917-1","전화":"02-2648-5290"},
		{"code":"D235","매장명":"올리브영_홈플러스목동점","주소":"서울 양천구 목동 919-7","전화":"02-2654-9013"},
		{"code":"505796","매장명":"왓슨스_당산역점","주소":"서울 영등포구 당산동6가 227 당산역","전화":"02-3667-7767"},
		{"code":"D053","매장명":"올리브영_서여의도점","주소":"서울 영등포구 여의도동 14-8","전화":"02-784-5290"},
		{"code":"511518","매장명":"왓슨스_국회의사당역점","주소":"서울 영등포구 여의도동 1-6","전화":"02-780-7554"},
		{"code":"508908","매장명":"왓슨스_IFC점","주소":"서울 영등포구 여의도동 23 23-1","전화":"02-6137-5534"},
		{"code":"D030","매장명":"올리브영_여의도역점","주소":"서울 영등포구 여의도동 25-15","전화":"02-780-5290"},
		{"code":"509568","매장명":"왓슨스_영등포점","주소":"서울 영등포구 영등포동 3가 10-15","전화":"02-2635-7535"},
		{"code":"D292","매장명":"올리브영_영등포역점","주소":"서울 영등포구 영등포동3가 10-12","전화":"02-2069-0642"},
		{"code":"D072","매장명":"올리브영_아트리움","주소":"서울 영등포구 영등포동4가 442","전화":"02-2638-2930"},
		{"code":"D073","매장명":"올리브영_타임스퀘어신세계점","주소":"서울 영등포구 영등포동4가 442","전화":"02-2677-5290"},
		{"code":"508074","매장명":"왓슨스_숙대역점","주소":"서울 용산구 갈월동 69-46  ","전화":"02-717-7566"},
		{"code":"D161","매장명":"올리브영_이태원점","주소":"서울 용산구 이태원동 127-12","전화":"02-796-9047"},
		{"code":"508425","매장명":"왓슨스_숙대2호점","주소":"서울 용산구 청파동2가 63-5","전화":"02-718-7535"},
		{"code":"D019","매장명":"올리브영_숙대점","주소":"서울 용산구 청파동3가 111-9","전화":"02-715-6828"},
		{"code":"D036","매장명":"올리브영_연신내점","주소":"서울 은평구 갈현동 396-4 ","전화":"02-359-5290"},
		{"code":"511606","매장명":"왓슨스_새절역점","주소":"서울 은평구 신사2동 337-5","전화":"02-305-7748"},
		{"code":"D258","매장명":"올리브영_응암점","주소":"서울 은평구 응암동 91-1","전화":"02-353-5191"},
		{"code":"512050","매장명":"왓슨스_DMC역점","주소":"서울 은평구 증산동 223-27","전화":"02-302-7667"},
		{"code":"D181","매장명":"올리브영_혜화역점","주소":"서울 종로구 동숭동 1-28","전화":"02-747-9967"},
		{"code":"B071","매장명":"올리브영_성균관대점","주소":"서울 종로구 명륜2가 211","전화":"02-763-7077"},
		{"code":"D014","매장명":"올리브영_대학로점","주소":"서울 종로구 명륜2가 33-2","전화":"02-745-5290"},
		{"code":"506139","매장명":"왓슨스_영풍종로점","주소":"서울 종로구 서린동 33","전화":"02-399-0080"},
		{"code":"D094","매장명":"올리브영_세종로점","주소":"서울 종로구 세종로 200 ","전화":"02-725-5290"},
		{"code":"D171","매장명":"올리브영_종로1가점","주소":"서울 종로구 종로1가 24","전화":"02-720-0918"},
		{"code":"D138","매장명":"올리브영_종로YBM점","주소":"서울 종로구 종로2가 55-1","전화":"02-2285-5290"},
		{"code":"506652","매장명":"왓슨스_종로2가점","주소":"서울 종로구 종로2가 84-5","전화":"02-733-5547"},
		{"code":"507796","매장명":"왓슨스_창신점","주소":"서울 종로구 창신동 354-1, 352-3","전화":"02-742-7456"},
		{"code":"505334","매장명":"왓슨스_명동중앙점","주소":"서울 중구 명동 2가 25-1, 29-9","전화":"02-3789-5562"},
		{"code":"D176","매장명":"올리브영_명동본점","주소":"서울 중구 명동1가 8-1","전화":"02-736-5290"},
		{"code":"D093","매장명":"올리브영_명동중앙점","주소":"서울 중구 명동2가 50-14","전화":"02-3789-5294"},
		{"code":"506046","매장명":"왓슨스_명동2가점","주소":"서울 중구 명동2가 95-1,90","전화":"02-753-0210"},
		{"code":"D107","매장명":"올리브영_씨제이쌍림점","주소":"서울 중구 쌍림동 292","전화":"02-6740-7940"},
		{"code":"D295","매장명":"올리브영_동대문역사문화공원역점","주소":"서울 중구 을지로6가 18-134","전화":"02-2279-8851"},
		{"code":"511177","매장명":"왓슨스_동대문DDP점","주소":"서울 중구 을지로7가 2-1 D살림터","전화":"02-2153-0735"},
		{"code":"511511","매장명":"왓슨스_면목역점","주소":"서울 중랑구 면목동 282-6","전화":"02-496-7555"},
		{"code":"511331","매장명":"왓슨스_사가정역점","주소":"서울 중랑구 면목동 495","전화":"02-435-7535"},
		{"code":"511389","매장명":"왓슨스_상봉역점","주소":"서울 중랑구 상봉동 100-9","전화":"02-433-7745"},
		{"code":"509257","매장명":"왓슨스_울산대점","주소":"울산 남구 무거동 630-2","전화":"052-225-7535"},
		{"code":"510015","매장명":"왓슨스_삼산점","주소":"울산 남구 삼산동 1523-1","전화":"052-260-7534"},
		{"code":"508907","매장명":"왓슨스_계산점","주소":"인천 계양구 계산2동 920-7 ","전화":"032-548-7535"},
		{"code":"E008","매장명":"올리브영_롯데마트계양점","주소":"인천 계양구 계산동 1059-1","전화":"032-551-5290"},
		{"code":"509820","매장명":"왓슨스_인하대점","주소":"인천 남구 용현동 191-4 ","전화":"032-862-7534"},
		{"code":"D117","매장명":"올리브영_인천구월점","주소":"인천 남동구 구월동 1457","전화":"032-421-5290"},
		{"code":"D218","매장명":"올리브영_인천구월로데오점","주소":"인천 남동구 구월동 1470","전화":"032-424-5290"},
		{"code":"D342","매장명":"올리브영_인천만수점","주소":"인천 남동구 만수동 1040-7","전화":"032-464-5290"},
		{"code":"507873","매장명":"왓슨스_부평2호점","주소":"인천 부평구 부평동 153-37 ","전화":"032-511-7587"},
		{"code":"505137","매장명":"왓슨스_부평점","주소":"인천 부평구 부평동 199-34, 50 ","전화":"032-501-9465"},
		{"code":"509442","매장명":"왓슨스_부평3호점","주소":"인천 부평구 부평동 549-18 ","전화":"032-518-7534"},
		{"code":"D351","매장명":"올리브영_인천청라점","주소":"인천 서구 연희동 801-1","전화":"032-567-5290"},
		{"code":"D155","매장명":"올리브영_인천스퀘어원점","주소":"인천 연수구 동춘동 926","전화":"032-456-4349"},
		{"code":"D054","매장명":"올리브영_인천공항점","주소":"인천 중구 운서동 2840","전화":"032-743-5290"},
		{"code":"D301","매장명":"올리브영_광양중마점","주소":"전남 광양시 중동 1641-2 ","전화":"061-795-9533"},
		{"code":"D112","매장명":"올리브영_전주중앙점","주소":"전북 전주시 완산구 고사동 114","전화":"063-282-5290"},
		{"code":"D289","매장명":"올리브영_전주서부신시가지점","주소":"전북 전주시 완산구 효자동3가 1535-4","전화":"063-237-5242"},
		{"code":"D313","매장명":"올리브영_제주시청점","주소":"제주 제주시 이도2동 1179-2","전화":"064-759-5290"},
		{"code":"D116","매장명":"올리브영_아산삼성전자점","주소":"충남 아산시 탕정면 명암리 산20-12","전화":"041-541-7214"},
		{"code":"D108","매장명":"올리브영_천안터미널점","주소":"충남 천안시 동남구 신부동 354-1","전화":"041-551-5290"},
		{"code":"D129","매장명":"올리브영_천안아라리오점","주소":"충남 천안시 동남구 신부동 97-3","전화":"041-622-8553"},
		{"code":"D346","매장명":"올리브영_천안쌍용점","주소":"충남 천안시 서북구 쌍용동 202-1","전화":"041-572-5290"},
		{"code":"509644","매장명":"왓슨스_청주성안점","주소":"충북 청주시 상당구 북문로1가 125-2, 124-3, 128-4","전화":"043-253-7532"},
		{"code":"D088","매장명":"올리브영_청주성안","주소":"충북 청주시 상당구 북문로1가 92-3","전화":"043-224-5290"},
		{"code":"509999","매장명":"왓슨스_충북대점","주소":"충북 청주시 서원구 사창동 422","전화":"043-277-7533"}
	]
});